In [2]:
import numpy as np

In [31]:
import pandas as pd

In [12]:
pd.read_csv('madmax.txt')

   1  2  3  4  5
0  a  b  c  d  e
1  d  e  f  g  h
2  q  w  e  r  t
3  m  n  b  v  c

In [25]:
pd.read_csv('fury.csv')

   1  2  3  4  5
0  a  b  c  d  e
1  d  e  f  g  h
2  q  w  e  r  t
3  m  n  b  v  c

In [47]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [64]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [51]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [58]:
df[['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905
C  0.807706  0.638787
D -0.497104 -0.943406
E -0.116773  0.238127

In [65]:
df['W']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [76]:
df['N']=df['W']+df['Y']

In [77]:
df['N']

A   -2.129908
B    0.994405
C    1.399521
D    0.705796
E   -2.059691
Name: N, dtype: float64

In [78]:
df

          W         X         Y         Z         N
A -0.993263  0.196800 -1.136645  0.000366 -2.129908
B  1.025984 -0.156598 -0.031579  0.649826  0.994405
C  2.154846 -0.610259 -0.755325 -0.346419  1.399521
D  0.147027 -0.479448  0.558769  1.024810  0.705796
E -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [90]:
df.drop('N',axis=1)

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [81]:
df.loc['A','W']

-0.993263499973366

In [84]:
df.loc[['A','C'],['X','Y']]

          X         Y
A  0.196800 -1.136645
C -0.610259 -0.755325

In [88]:
df>0

       W      X      Y      Z      N
A  False   True  False   True  False
B   True  False  False   True   True
C   True  False  False  False   True
D   True  False   True   True   True
E  False   True  False   True  False

       W      X      Y      Z      N
A  False   True  False   True  False
B   True  False  False   True   True
C   True  False  False  False   True
D   True  False   True   True   True
E  False   True  False   True  False

In [91]:
df

          W         X         Y         Z         N
A -0.993263  0.196800 -1.136645  0.000366 -2.129908
B  1.025984 -0.156598 -0.031579  0.649826  0.994405
C  2.154846 -0.610259 -0.755325 -0.346419  1.399521
D  0.147027 -0.479448  0.558769  1.024810  0.705796
E -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [93]:
df[df>1]

          W         X   Y        Z         N
A       NaN       NaN NaN      NaN       NaN
B  1.025984       NaN NaN      NaN       NaN
C  2.154846       NaN NaN      NaN  1.399521
D       NaN       NaN NaN  1.02481       NaN
E       NaN  1.862864 NaN      NaN       NaN

In [96]:
lab=['a','b','c','d']
numb=[1,2,3,4]
np.array([21,22,23,24])
d={'a':10,'b':20,'c':30,'d':40}

In [107]:
pd.Series(data=numb,index='a b c d'.split())

a    1
b    2
c    3
d    4
dtype: int64